<?xml version="1.0"?>
<GCC_XML cvs_revision="1.121">

  <Function id="_378" name="__builtin_cargf" returns="_410" context="_1" mangled="cargf" location="f1:93" file="f1" line="93" extern="1" attributes="nothrow pure no vops">
    <Argument type="_426" location="f1:93" file="f1" line="93"/>
  </Function>
  <Function id="_379" name="__builtin_cargl" returns="_411" context="_1" mangled="cargl" location="f1:95" file="f1" line="95" extern="1" attributes="nothrow pure no vops">
    <Argument type="_427" location="f1:95" file="f1" line="95"/>
  </Function>
  <Struct id="_380" name="usb_hid_descriptor" context="_1" mangled="18usb_hid_descriptor" demangled="usb_hid_descriptor" location="f3:76" file="f3" line="76" artificial="1" attributes="packed" size="48" align="8" members="_493 _494 _495 _496 _497 " bases=""/>
  <Function id="_381" name="__builtin_cosf" returns="_410" context="_1" mangled="cosf" location="f1:40" file="f1" line="40" extern="1" attributes="nothrow pure no vops">
    <Argument type="_410" location="f1:40" file="f1" line="40"/>
  </Function>
  <Function id="_382" name="__builtin_cosh" returns="_408" context="_1" mangled="cosh" location="f1:41" file="f1" line="41" extern="1" attributes="nothrow">
    <Argument type="_408" location="f1:41" file="f1" line="41"/>
  </Function>
  <Variable id="_383" name="cpp_sym_PIPE_BUF" type="_105c" init="4096" context="_1" location="f0:143" file="f0" line="143"/>
  <Function id="_384" name="__builtin_cosl" returns="_411" context="_1" mangled="cosl" location="f1:44" file="f1" line="44" extern="1" attributes="nothrow pure no vops">
    <Argument type="_411" location="f1:44" file="f1" line="44"/>
  </Function>
  <Variable id="_385" name="cpp_sym__POSIX_LINK_MAX" type="_105c" init="8" context="_1" location="f0:11" file="f0" line="11"/>
  <Struct id="_386" name="usb_device_descriptor" context="_1" mangled="21usb_device_descriptor" demangled="usb_device_descriptor" location="f3:157" file="f3" line="157" artificial="1" attributes="packed" size="144" align="8" members="_498 _499 _500 _501 _502 _503 _504 _505 _506 _507 _508 _509 _510 _511 " bases=""/>
  <Variable id="_387" name="cpp_sym___USE_FORTIFY_LEVEL" type="_105c" init="2" context="_1" location="f0:120" file="f0" line="120"/>
  <Variable id="_388" name="cpp_sym__POSIX2_EXPR_NEST_MAX" type="_105c" init="32" context="_1" location="f0:149" file="f0" line="149"/>
  <Function id="_389" name="__builtin_isgreater" returns="_412" context="_1" location="f1:139" file="f1" line="139" extern="1" attributes="nothrow const">
    <Ellipsis/>
  </Function>
  <Variable id="_390" name="cpp_sym_SHRT_MIN" type="_105c" init="-0x00000000000008000" context="_1" location="f0:30" file="f0" line="30"/>
  <Variable id="_391" name="cpp_sym_COLL_WEIGHTS_MAX" type="_105c" init="255" context="_1" location="f0:186" file="f0" line="186"/>
  <Variable id="_392" name="cpp_sym_USB_TYPE_RESERVED" type="_105c" init="96" context="_1" location="f0:13" file="f0" line="13"/>
  <Typedef id="_393" name="uint_least8_t" type="_312" context="_1" location="f2:77" file="f2" line="77"/>
  <Variable id="_394" name="cpp_sym__POSIX_THREAD_THREADS_MAX" type="_105c" init="64" context="_1" location="f0:187" file="f0" line="187"/>
  <Variable id="_395" name="cpp_sym_LOGIN_NAME_MAX" type="_105c" init="256" context="_1" location="f0:168" file="f0" line="168"/>
  <Function id="_396" name="usb_get_string" returns="_105" context="_1" location="f3:283" file="f3" line="283" extern="1">
    <Argument name="dev" type="_414" location="f3:283" file="f3" line="283"/>
    <Argument name="index" type="_105" location="f3:283" file="f3" line="283"/>
    <Argument name="langid" type="_105" location="f3:283" file="f3" line="283"/>
    <Argument name="buf" type="_433" location="f3:283" file="f3" line="283"/>
    <Argument name="buflen" type="_271" location="f3:283" file="f3" line="283"/>
  </Function>
  <Variable id="_397" name="cpp_sym_UINT_MAX" type="_168c" init="4294967295u" context="_1" location="f0:36" file="f0" line="36"/>
  <Function id="_398" name="__builtin_sinf" returns="_410" context="_1" mangled="sinf" location="f1:76" file="f1" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_410" location="f1:76" file="f1" line="76"/>
  </Function>
  <Function id="_399" name="__builtin_sinh" returns="_408" context="_1" mangled="sinh" location="f1:77" file="f1" line="77" extern="1" attributes="nothrow">
    <Argument type="_408" location="f1:77" file="f1" line="77"/>
  </Function>
  <Function id="_400" name="__builtin_sinl" returns="_411" context="_1" mangled="sinl" location="f1:80" file="f1" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_411" location="f1:80" file="f1" line="80"/>
  </Function>
  <Typedef id="_401" name="uint64_t" type="_8" context="_1" location="f2:56" file="f2" line="56"/>
  <Function id="_402" name="__builtin_csin" returns="_429" context="_1" mangled="csin" location="f1:115" file="f1" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_429" location="f1:115" file="f1" line="115"/>
  </Function>
  <Variable id="_403" name="cpp_sym_LLONG_MIN" type="_425c" init="-0x08000000000000000ll" context="_1" location="f0:180" file="f0" line="180"/>
  <Variable id="_404" name="cpp_sym_USB_RECIP_OTHER" type="_105c" init="3" context="_1" location="f0:41" file="f0" line="41"/>
  <Variable id="_405" name="cpp_sym__POSIX_SOURCE" type="_105c" init="1" context="_1" location="f0:35" file="f0" line="35"/>
  <Variable id="_406" name="cpp_sym__POSIX_NAME_MAX" type="_105c" init="14" context="_1" location="f0:189" file="f0" line="189"/>
  <CvQualifiedType id="_105c" type="_105" const="1"/>
  <FundamentalType id="_408" name="double" size="64" align="64"/>
  <PointerType id="_409" type="_513c" size="64" align="64"/>
  <FundamentalType id="_410" name="float" size="32" align="32"/>
  <FundamentalType id="_411" name="long double" size="128" align="128"/>
  <FundamentalType id="_412" name="bool" size="8" align="8"/>
  <PointerType id="_413" type="_13" size="64" align="64"/>
  <PointerType id="_414" type="_234" size="64" align="64"/>
  <Field id="_415" name="next" type="_413" offset="0" context="_13" access="public" location="f3:239" file="f3" line="239"/>
  <Field id="_416" name="prev" type="_413" offset="64" context="_13" access="public" location="f3:239" file="f3" line="239"/>
  <Field id="_417" name="filename" type="_515" offset="128" context="_13" access="public" location="f3:241" file="f3" line="241"/>
  <Field id="_418" name="bus" type="_460" offset="32960" context="_13" access="public" location="f3:243" file="f3" line="243"/>
  <Field id="_419" name="descriptor" type="_386" offset="33024" context="_13" access="public" location="f3:245" file="f3" line="245"/>
  <Field id="_420" name="config" type="_516" offset="33216" context="_13" access="public" location="f3:246" file="f3" line="246"/>
  <Field id="_421" name="dev" type="_457" offset="33280" context="_13" access="public" location="f3:248" file="f3" line="248"/>
  <Field id="_422" name="devnum" type="_323" offset="33344" context="_13" access="public" location="f3:250" file="f3" line="250"/>
  <Field id="_423" name="num_children" type="_312" offset="33352" context="_13" access="public" location="f3:252" file="f3" line="252"/>
  <Field id="_424" name="children" type="_517" offset="33408" context="_13" access="public" location="f3:253" file="f3" line="253"/>
  <FundamentalType id="_425" name="long long int" size="64" align="64"/>
  <FundamentalType id="_426" name="complex float" size="64" align="32"/>
  <FundamentalType id="_427" name="complex long double" size="256" align="128"/>
  <CvQualifiedType id="_57c" type="_57" const="1"/>
  <FundamentalType id="_429" name="complex double" size="128" align="64"/>
  <Field id="_430" name="bLength" type="_323" offset="0" context="_49" access="public" location="f3:64" file="f3" line="64"/>
  <Field id="_431" name="bDescriptorType" type="_323" offset="8" context="_49" access="public" location="f3:65" file="f3" line="65"/>
  <FundamentalType id="_432" name="void" align="8"/>
  <PointerType id="_433" type="_513" size="64" align="64"/>
  <Field id="_434" name="bLength" type="_323" offset="0" context="_78" access="public" location="f3:141" file="f3" line="141"/>
  <Field id="_435" name="bDescriptorType" type="_323" offset="8" context="_78" access="public" location="f3:142" file="f3" line="142"/>
  <Field id="_436" name="wTotalLength" type="_306" offset="16" context="_78" access="public" location="f3:143" file="f3" line="143"/>
  <Field id="_437" name="bNumInterfaces" type="_323" offset="32" context="_78" access="public" location="f3:144" file="f3" line="144"/>
  <Field id="_438" name="bConfigurationValue" type="_323" offset="40" context="_78" access="public" location="f3:145" file="f3" line="145"/>
  <Field id="_439" name="iConfiguration" type="_323" offset="48" context="_78" access="public" location="f3:146" file="f3" line="146"/>
  <Field id="_440" name="bmAttributes" type="_323" offset="56" context="_78" access="public" location="f3:147" file="f3" line="147"/>
  <Field id="_441" name="MaxPower" type="_323" offset="64" context="_78" access="public" location="f3:148" file="f3" line="148"/>
  <Field id="_442" name="interface" type="_518" offset="128" context="_78" access="public" location="f3:150" file="f3" line="150"/>
  <Field id="_443" name="extra" type="_519" offset="192" context="_78" access="public" location="f3:152" file="f3" line="152"/>
  <Field id="_444" name="extralen" type="_105" offset="256" context="_78" access="public" location="f3:153" file="f3" line="153"/>
  <Field id="_445" name="bLength" type="_323" offset="0" context="_79" access="public" location="f3:115" file="f3" line="115"/>
  <Field id="_446" name="bDescriptorType" type="_323" offset="8" context="_79" access="public" location="f3:116" file="f3" line="116"/>
  <Field id="_447" name="bInterfaceNumber" type="_323" offset="16" context="_79" access="public" location="f3:117" file="f3" line="117"/>
  <Field id="_448" name="bAlternateSetting" type="_323" offset="24" context="_79" access="public" location="f3:118" file="f3" line="118"/>
  <Field id="_449" name="bNumEndpoints" type="_323" offset="32" context="_79" access="public" location="f3:119" file="f3" line="119"/>
  <Field id="_450" name="bInterfaceClass" type="_323" offset="40" context="_79" access="public" location="f3:120" file="f3" line="120"/>
  <Field id="_451" name="bInterfaceSubClass" type="_323" offset="48" context="_79" access="public" location="f3:121" file="f3" line="121"/>
  <Field id="_452" name="bInterfaceProtocol" type="_323" offset="56" context="_79" access="public" location="f3:122" file="f3" line="122"/>
  <Field id="_453" name="iInterface" type="_323" offset="64" context="_79" access="public" location="f3:123" file="f3" line="123"/>
  <Field id="_454" name="endpoint" type="_520" offset="128" context="_79" access="public" location="f3:125" file="f3" line="125"/>
  <Field id="_455" name="extra" type="_519" offset="192" context="_79" access="public" location="f3:127" file="f3" line="127"/>
  <Field id="_456" name="extralen" type="_105" offset="256" context="_79" access="public" location="f3:128" file="f3" line="128"/>
  <PointerType id="_457" type="_432" size="64" align="64"/>
  <PointerType id="_458" type="_432c" size="64" align="64"/>
  <PointerType id="_459" type="_105" size="64" align="64"/>
  <PointerType id="_460" type="_296" size="64" align="64"/>
  <PointerType id="_461" type="_410" size="64" align="64"/>
  <PointerType id="_462" type="_411" size="64" align="64"/>
  <FundamentalType id="_463" name="long long unsigned int" size="64" align="64"/>
  <CvQualifiedType id="_463c" type="_463" const="1"/>
  <Field id="_465" name="bRequestType" type="_323" offset="0" context="_238" access="public" location="f3:175" file="f3" line="175"/>
  <Field id="_466" name="bRequest" type="_323" offset="8" context="_238" access="public" location="f3:176" file="f3" line="176"/>
  <Field id="_467" name="wValue" type="_306" offset="16" context="_238" access="public" location="f3:177" file="f3" line="177"/>
  <Field id="_468" name="wIndex" type="_306" offset="32" context="_238" access="public" location="f3:178" file="f3" line="178"/>
  <Field id="_469" name="wLength" type="_306" offset="48" context="_238" access="public" location="f3:179" file="f3" line="179"/>
  <Field id="_470" name="altsetting" type="_522" offset="0" context="_255" access="public" location="f3:133" file="f3" line="133"/>
  <Field id="_471" name="num_altsetting" type="_105" offset="64" context="_255" access="public" location="f3:135" file="f3" line="135"/>
  <Field id="_472" name="bLength" type="_323" offset="0" context="_262" access="public" location="f3:70" file="f3" line="70"/>
  <Field id="_473" name="bDescriptorType" type="_323" offset="8" context="_262" access="public" location="f3:71" file="f3" line="71"/>
  <Field id="_474" name="wData" type="_523" offset="16" context="_262" access="public" location="f3:72" file="f3" line="72"/>
  <CvQualifiedType id="_8c" type="_8" const="1"/>
  <Field id="_476" name="next" type="_460" offset="0" context="_296" access="public" location="f3:257" file="f3" line="257"/>
  <Field id="_477" name="prev" type="_460" offset="64" context="_296" access="public" location="f3:257" file="f3" line="257"/>
  <Field id="_478" name="dirname" type="_515" offset="128" context="_296" access="public" location="f3:259" file="f3" line="259"/>
  <Field id="_479" name="devices" type="_413" offset="32960" context="_296" access="public" location="f3:261" file="f3" line="261"/>
  <Field id="_480" name="location" type="_169" offset="33024" context="_296" access="public" location="f3:262" file="f3" line="262"/>
  <Field id="_481" name="root_dev" type="_413" offset="33088" context="_296" access="public" location="f3:264" file="f3" line="264"/>
  <Field id="_482" name="bLength" type="_323" offset="0" context="_315" access="public" location="f3:90" file="f3" line="90"/>
  <Field id="_483" name="bDescriptorType" type="_323" offset="8" context="_315" access="public" location="f3:91" file="f3" line="91"/>
  <Field id="_484" name="bEndpointAddress" type="_323" offset="16" context="_315" access="public" location="f3:92" file="f3" line="92"/>
  <Field id="_485" name="bmAttributes" type="_323" offset="24" context="_315" access="public" location="f3:93" file="f3" line="93"/>
  <Field id="_486" name="wMaxPacketSize" type="_306" offset="32" context="_315" access="public" location="f3:94" file="f3" line="94"/>
  <Field id="_487" name="bInterval" type="_323" offset="48" context="_315" access="public" location="f3:95" file="f3" line="95"/>
  <Field id="_488" name="bRefresh" type="_323" offset="56" context="_315" access="public" location="f3:96" file="f3" line="96"/>
  <Field id="_489" name="bSynchAddress" type="_323" offset="64" context="_315" access="public" location="f3:97" file="f3" line="97"/>
  <Field id="_490" name="extra" type="_519" offset="128" context="_315" access="public" location="f3:99" file="f3" line="99"/>
  <Field id="_491" name="extralen" type="_105" offset="192" context="_315" access="public" location="f3:100" file="f3" line="100"/>
  <CvQualifiedType id="_425c" type="_425" const="1"/>
  <Field id="_493" name="bLength" type="_323" offset="0" context="_380" access="public" location="f3:77" file="f3" line="77"/>
  <Field id="_494" name="bDescriptorType" type="_323" offset="8" context="_380" access="public" location="f3:78" file="f3" line="78"/>
  <Field id="_495" name="bcdHID" type="_306" offset="16" context="_380" access="public" location="f3:79" file="f3" line="79"/>
  <Field id="_496" name="bCountryCode" type="_323" offset="32" context="_380" access="public" location="f3:80" file="f3" line="80"/>
  <Field id="_497" name="bNumDescriptors" type="_323" offset="40" context="_380" access="public" location="f3:81" file="f3" line="81"/>
  <Field id="_498" name="bLength" type="_323" offset="0" context="_386" access="public" location="f3:158" file="f3" line="158"/>
  <Field id="_499" name="bDescriptorType" type="_323" offset="8" context="_386" access="public" location="f3:159" file="f3" line="159"/>
  <Field id="_500" name="bcdUSB" type="_306" offset="16" context="_386" access="public" location="f3:160" file="f3" line="160"/>
  <Field id="_501" name="bDeviceClass" type="_323" offset="32" context="_386" access="public" location="f3:161" file="f3" line="161"/>
  <Field id="_502" name="bDeviceSubClass" type="_323" offset="40" context="_386" access="public" location="f3:162" file="f3" line="162"/>
  <Field id="_503" name="bDeviceProtocol" type="_323" offset="48" context="_386" access="public" location="f3:163" file="f3" line="163"/>
  <Field id="_504" name="bMaxPacketSize0" type="_323" offset="56" context="_386" access="public" location="f3:164" file="f3" line="164"/>
  <Field id="_505" name="idVendor" type="_306" offset="64" context="_386" access="public" location="f3:165" file="f3" line="165"/>
  <Field id="_506" name="idProduct" type="_306" offset="80" context="_386" access="public" location="f3:166" file="f3" line="166"/>
  <Field id="_507" name="bcdDevice" type="_306" offset="96" context="_386" access="public" location="f3:167" file="f3" line="167"/>
  <Field id="_508" name="iManufacturer" type="_323" offset="112" context="_386" access="public" location="f3:168" file="f3" line="168"/>
  <Field id="_509" name="iProduct" type="_323" offset="120" context="_386" access="public" location="f3:169" file="f3" line="169"/>
  <Field id="_510" name="iSerialNumber" type="_323" offset="128" context="_386" access="public" location="f3:170" file="f3" line="170"/>
  <Field id="_511" name="bNumConfigurations" type="_323" offset="136" context="_386" access="public" location="f3:171" file="f3" line="171"/>
  <CvQualifiedType id="_168c" type="_168" const="1"/>
  <ArrayType id="_515" min="0" max="4096u" type="_513" size="32776" align="8"/>
  <PointerType id="_516" type="_78" size="64" align="64"/>
  <PointerType id="_517" type="_413" size="64" align="64"/>
  <PointerType id="_518" type="_255" size="64" align="64"/>
  <PointerType id="_519" type="_312" size="64" align="64"/>
  <PointerType id="_520" type="_315" size="64" align="64"/>
  <PointerType id="_522" type="_79" size="64" align="64"/>
  <ArrayType id="_523" min="0" max="0u" type="_306" size="16" align="16"/>
  <FundamentalType id="_513" name="char" size="8" align="8"/>
  <CvQualifiedType id="_513c" type="_513" const="1"/>
  <CvQualifiedType id="_432c" type="_432" const="1"/>
  <File id="f0" name="/tmp/tmpkKqsYx.cpp"/>
  <File id="f1" name="/usr/share/gccxml-0.9/GCC/4.3/gccxml_builtins.h"/>
  <File id="f2" name="/usr/include/stdint.h"/>
  <File id="f3" name="./usb.h"/>
  <File id="f4" name="/usr/lib/gcc/x86_64-linux-gnu/4.4.1/include/stddef.h"/>
  <CPP_DUMP name="functions"><![CDATA[__ASMNAME(cname) __ASMNAME2 (__USER_LABEL_PREFIX__, cname)
__ASMNAME2(prefix,cname) __STRING (prefix) cname
__CONCAT(x,y) x ## y
__GLIBC_PREREQ(maj,min) ((__GLIBC__ << 16) + __GLIBC_MINOR__ >= ((maj) << 16) + (min))
__GNUC_PREREQ(maj,min) ((__GNUC__ << 16) + __GNUC_MINOR__ >= ((maj) << 16) + (min))
__LDBL_REDIR(name,proto) name proto
__LDBL_REDIR1(name,proto,alias) name proto
__LDBL_REDIR1_NTH(name,proto,alias) name proto __THROW
__LDBL_REDIR_NTH(name,proto) name proto __THROW
__NTH(fct) fct throw ()
__P(args) args
__PMT(args) args
__REDIRECT(name,proto,alias) name proto __asm__ (__ASMNAME (#alias))
__REDIRECT_LDBL(name,proto,alias) __REDIRECT (name, proto, alias)
__REDIRECT_NTH(name,proto,alias) name proto __THROW __asm__ (__ASMNAME (#alias))
__REDIRECT_NTH_LDBL(name,proto,alias) __REDIRECT_NTH (name, proto, alias)
__STRING(x) #x
__attribute_format_arg__(x) __attribute__ ((__format_arg__ (x)))
__attribute_format_strfmon__(a,b) __attribute__ ((__format__ (__strfmon__, a, b)))
__bos(ptr) __builtin_object_size (ptr, __USE_FORTIFY_LEVEL > 1)
__bos0(ptr) __builtin_object_size (ptr, 0)
__errordecl(name,msg) extern void name (void) __attribute__((__error__ (msg)))
__nonnull(params) __attribute__ ((__nonnull__ params))
__va_arg_pack() __builtin_va_arg_pack ()
__va_arg_pack_len() __builtin_va_arg_pack_len ()
__warnattr(msg) __attribute__((__warning__ (msg)))
__warndecl(name,msg) extern void name (void) __attribute__((__warning__ (msg)))
offsetof(TYPE,MEMBER) __builtin_offsetof (TYPE, MEMBER)
]]></CPP_DUMP>
  <CPP_DUMP name="aliases"><![CDATA[BC_BASE_MAX _POSIX2_BC_BASE_MAX
BC_DIM_MAX _POSIX2_BC_DIM_MAX
BC_SCALE_MAX _POSIX2_BC_SCALE_MAX
BC_STRING_MAX _POSIX2_BC_STRING_MAX
CHAR_BIT __CHAR_BIT__
CHAR_MAX SCHAR_MAX
CHAR_MIN SCHAR_MIN
EXPR_NEST_MAX _POSIX2_EXPR_NEST_MAX
INT_MAX __INT_MAX__
LINE_MAX _POSIX2_LINE_MAX
LLONG_MAX __LONG_LONG_MAX__
LONG_LONG_MAX __LONG_LONG_MAX__
LONG_MAX __LONG_MAX__
NL_ARGMAX _POSIX_ARG_MAX
NL_LANGMAX _POSIX2_LINE_MAX
NL_MSGMAX INT_MAX
NL_NMAX INT_MAX
NL_SETMAX INT_MAX
NL_TEXTMAX INT_MAX
NULL __null
PTHREAD_DESTRUCTOR_ITERATIONS _POSIX_THREAD_DESTRUCTOR_ITERATIONS
SCHAR_MAX __SCHAR_MAX__
SHRT_MAX __SHRT_MAX__
SSIZE_MAX LONG_MAX
_POSIX_FD_SETSIZE _POSIX_OPEN_MAX
_POSIX_HIWAT _POSIX_PIPE_BUF
_XOPEN_IOV_MAX _POSIX_UIO_MAXIOV
__WCHAR_MAX __WCHAR_MAX__
__wur __attribute_warn_unused_result__
]]></CPP_DUMP>
  <CPP_DUMP name="excluded"><![CDATA[__BEGIN_DECLS extern "C" {
__END_DECLS }
]]></CPP_DUMP>
</GCC_XML>
